# Angle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData..::..Angle Property
PipeFittingAndAccessoryConnectorData Class See Also
---
The angle of the fitting, Units:(rad).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Angle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Angle As Double
	Get
```

Visual C++
---
```text
public:
property double Angle {
	double get ();
}
```

# See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace